# Main
7zip
bat
bat-extras
# curl
dconf
dconf-editor
eza
fd
git
gnome-shell
gnome-system-monitor
gnome-tweaks
gnupg
inxi
jq
libreoffice-fresh
obsidian
p7zip
pass
plymouth
python
python-pip
rsync
starship
ufw
xclip
zoxide
xdotool
ydotool

### VC
nvidia
nvidia-container-toolkit
nvidia-utils
nvidia-settings
# nvidia-dkms
vulkan-radeon

# Terminals & fetchers
alacritty
fastfetch
ghostty
kitty
neofetch
onefetch
tmux

# Disks
parted
gparted
ntfs-3g
partitionmanager

### Shell
fish
fisher
# nushell
zsh
zsh-completions

# Download
deluge-gtk
uget
# wget

# Image viewers / Media
eog
feh
# gimp
# gthumb
imagemagick
lximage-qt
mpv
qimgv
simplescreenrecorder

# Sound / Media
audacity
# ffmpeg
pamixer
pavucontrol
pipewire
wireplumber
pipewire-audio
pipewire-alsa
pipewire-pulse
playerctl
mpc
mpd
ncmpcpp
# vlc
yt-dlp

# BT
bluez
bluez-utils
blueman

# Fonts
fontconfig
noto-fonts
otf-font-awesome
ttf-droid
ttf-fira-code
ttf-fira-sans
ttf-firacode-nerd
ttf-font-awesome
ttf-hack
ttf-hack-nerd
ttf-iosevka-nerd
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols

# Editors
geany
geany-plugins
# micro
# nano
neovim
# vim

# Hyprland
copyq
cmatrix
# fabric
feh
figlet
grim
gum
hypridle
hyprland
hyprlock
libnotify
network-manager-applet
nwg-dock
obs-studio
power-profiles-daemon
qt5-wayland
qt6-wayland
refind
reflector
rofi
swayimg
swaync
swww
waybar
wl-clipboard
wofi
xdg-desktop-portal
xdg-desktop-portal-hyprland

# SDDM & plasma themes packages for it
plasma-desktop
plasma-framework5
plasma-nm
plasma-thunderbolt
plasma-wayland-protocols
sddm-git
qt5-graphicaleffects
qt5-quickcontrols2
qt5-svg
qt6-5compat
qt6-declarative
qt6-svg

# GPU
cuda
cudnn

### Themes
arc-icon-theme
arc-gtk-theme
# Tokyonight GTK Theme:
gtk-engine-murrine

# Network
networkmanager
network-manager-applet
networkmanager-dmenu-git
networkmanager-openconnect
networkmanager-openvpn
networkmanager-pptp
nm-connection-editor
nmap
openconnect
# openssh
openvpn
# wireless_tools
# wpa_supplicant

# Browser
lynx

# File Manager
nemo
nemo-fileroller
nemo-preview
nemo-seahorse
nemo-qml-plugin-configuration
nemo-qml-plugin-notifications
net-tools
ranger

# AI
ollama
speech-dispatcher

# Tools
bleachbit
brightnessctl
btop
htop
ddgr
deluge-gtk
discord
dmenu
dmidecode
duf
dust
filezilla
kdenlive
keepassxc
meld
ncdu
nwg-dock
steam
virtualbox
virtualbox-host-dkms
# xdg-utils

### Work
docker
docker-buildx
docker-compose
# gitg
hub
github-cli
# john
lazygit
# mariadb
nodejs
npm

# Others
asciiquarium
cowfortune
android-tools
android-file-transfer
betterlockscreen
kdeconnect
kdiff3
kruler
krusader
lshw
scrcpy
speedtest-cli
stow
# syncthing
telegram-desktop
# testdisk
# timeshift
tldr
veracrypt
wine-staging
