# Main
git
curl
inxi
jq
gnome-tweaks
gnome-system-monitor
zoxide
pass
gnupg


# Terminals & fetchers
alacritty
fastfetch
kitty
neofetch
tmux

# Disks
parted
gparted
partitionmanager

# Shells
fish
fisher
zsh
zsh-completions

# Download
wget
uget
deluge-gtk

# Image viewers / Media
eog
feh
# gimp
# gthumb
imagemagick
lximage-qt
mpv
qimgv

# Sound
pamixer
pavucontrol
pipewire
wireplumber
pipewire-audio
pipewire-alsa
pipewire-pulse
playerctl
mpd
ncmpcpp

# BT
bluez
bluez-utils
blueman

# fonts
fontconfig
noto-fonts
otf-font-awesome
ttf-droid
ttf-fira-code
ttf-fira-sans
ttf-firacode-nerd
ttf-font-awesome
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd

# editors
vim
neovim
nano
micro
geany

# Hyprland
copyq
feh
figlet
gum
hypridle
hyprland
hyprlock
libnotify
network-manager-applet
obs-studio
qt5-wayland
qt6-wayland
rofi
swayimg
swaync
swww
waybar
wl-clipboard
wofi

# SDDM
sddm
qt5-graphicaleffects
qt5-quickcontrols2
qt5-svg
qt6-5compat
qt6-declarative
qt6-svg

# GPU
cuda
cudnn

### Themes
arc-gtk-theme
# Tokyonight GTK Theme:
gtk-engine-murrine

# network
networkmanager
networkmanager-dmenu

# AI
ollama

# Tools
virtualbox
virtualbox-host-dkms
